In [1]:
import pandas as pd
import numpy as np

In [3]:
data = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
series = pd.Series(data)
print("Original Series:\n", series)

Original Series:
 0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [4]:
data = {'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5}
series_from_dict = pd.Series(data)
print("\nSeries from Dictionary:\n", series_from_dict)

Series from Dictionary:
 a    1
b    2
c    3
d    4
e    5
dtype: int64

In [5]:
data = [10, 20, 30, 40, 50]
index = ['a', 'b', 'c', 'd', 'e']
series_with_index = pd.Series(data, index=index)
print("\nSeries with Custom Index:\n", series_with_index)

Series with Custom Index:
 a    10
b    20
c    30
d    40
e    50
dtype: int64

In [6]:
data = {
    'Name' : ['Alice', 'Bob', 'Charlie'],
    'Age' : [25, 30, 35],
    'City' : ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)
print("\nDataFrame:\n", df)

DataFrame:
       Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [9]:
import os
print(os.getcwd())
path = os.getcwd() + '/random_dataset.csv'

/Users/aple/Documents/VSCode_GitHub/MLOps Bootcamp/Python Prerequisites

In [10]:
df = pd.read_csv(path)
print("\nDataFrame from CSV:\n", df.head())

DataFrame from CSV:
   Column_1 Column_2 Column_3 Column_4 Column_5 Column_6 Column_7 Column_8  \
0        A        F        D        D        I        I        C        C
1        G        B        J        E        H        E        H        H
2        D        C        D        E        B        C        D        H
3        B        D        D        F        D        B        J        B
4        F        G        B        J        E        G        G        E

  Column_9 Column_10 Column_11 Column_12 Column_13 Column_14 Column_15
0        B         F         G         E         J         F         E
1        A         J         F         G         E         A         F
2        F         H         I         I         C         I         C
3        F         B         J         G         G         C         F
4        G         E         D         D         D         H         B

In [11]:
df.tail()

,Column_1,Column_2,Column_3,Column_4,Column_5,Column_6,Column_7,Column_8,Column_9,Column_10,Column_11,Column_12,Column_13,Column_14,Column_15
9995,J,B,E,E,E,E,J,G,F,I,D,I,H,H,C
9996,E,G,B,A,B,D,I,G,J,I,G,C,B,C,E
9997,I,I,H,G,G,H,E,G,I,I,H,G,A,C,F
9998,F,D,I,J,H,A,G,G,E,A,E,D,F,G,A
9999,E,D,C,J,D,A,C,E,D,I,J,H,C,A,E

In [13]:
df = pd.DataFrame(data)

In [14]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [15]:
df['Name']

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [16]:
df.loc[0]

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [17]:
df.iloc[0]

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [18]:
df.at[1, 'Age']

30

In [19]:
df['Salary'] = [50000, 60000, 70000]
df

      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000

In [20]:
df.describe()

        Age   Salary
count   3.0      3.0
mean   30.0  60000.0
std     5.0  10000.0
min    25.0  50000.0
25%    27.5  55000.0
50%    30.0  60000.0
75%    32.5  65000.0
max    35.0  70000.0

In [21]:
path = os.getcwd() + '/data.csv'
df = pd.read_csv(path)
df.head()

        Name        Date     Category    Sales   Region
0       Bill  2024-03-05    Groceries  3972.79    North
1       Trip  2024-03-11  Electronics  2817.34    North
2     Nature  2024-11-18    Furniture  1355.12     East
3  Interview  2025-02-25    Groceries  4233.83  Central
4    Require  2025-05-16         Toys  2996.68  Central

In [22]:
df.describe()

             Sales
count   526.000000
mean   2593.682871
std    1399.608518
min      10.760000
25%    1526.645000
50%    2643.750000
75%    3765.505000
max    4996.500000

In [23]:
df.isnull()

      Name   Date  Category  Sales  Region
0    False  False     False  False   False
1    False  False     False  False   False
2    False  False     False  False   False
3    False  False     False  False   False
4    False  False     False  False   False
..     ...    ...       ...    ...     ...
521  False  False     False  False   False
522  False  False     False  False   False
523  False  False     False  False   False
524  False  False     False  False   False
525  False  False     False  False   False

[526 rows x 5 columns]

In [24]:
df.dtypes

Name         object
Date         object
Category     object
Sales       float64
Region       object
dtype: object

In [25]:
df = df.rename(columns={'Date': 'Sale Date'})
df.head()

        Name   Sale Date     Category    Sales   Region
0       Bill  2024-03-05    Groceries  3972.79    North
1       Trip  2024-03-11  Electronics  2817.34    North
2     Nature  2024-11-18    Furniture  1355.12     East
3  Interview  2025-02-25    Groceries  4233.83  Central
4    Require  2025-05-16         Toys  2996.68  Central

In [26]:
df['New_Total'] = df['Sales'].astype(int)
df.head()

        Name   Sale Date     Category    Sales   Region  New_Total
0       Bill  2024-03-05    Groceries  3972.79    North       3972
1       Trip  2024-03-11  Electronics  2817.34    North       2817
2     Nature  2024-11-18    Furniture  1355.12     East       1355
3  Interview  2025-02-25    Groceries  4233.83  Central       4233
4    Require  2025-05-16         Toys  2996.68  Central       2996

In [27]:
df['New_Val'] = df['Sales'].apply(lambda x: x * 2)
df.head()

        Name   Sale Date     Category    Sales   Region  New_Total  New_Val
0       Bill  2024-03-05    Groceries  3972.79    North       3972  7945.58
1       Trip  2024-03-11  Electronics  2817.34    North       2817  5634.68
2     Nature  2024-11-18    Furniture  1355.12     East       1355  2710.24
3  Interview  2025-02-25    Groceries  4233.83  Central       4233  8467.66
4    Require  2025-05-16         Toys  2996.68  Central       2996  5993.36

In [28]:
grouped_mean = df.groupby('Category')['Sales'].mean()
print("\nGrouped Mean:\n", grouped_mean)

Grouped Mean:
 Category
Books          2653.585618
Clothing       2657.736506
Electronics    2536.222955
Furniture      2515.696111
Groceries      2336.660723
Toys           2838.417527
Name: Sales, dtype: float64

In [29]:
group_by_two_columns = df.groupby(['Category', 'Region'])['Sales'].sum()
print("\nGrouped by Two Columns:\n", group_by_two_columns)

Grouped by Two Columns:
 Category     Region
Books        Central    52827.77
             East       48066.75
             North      40381.18
             South      48124.30
             West       46769.12
Clothing     Central    39293.27
             East       39627.90
             North      63557.08
             South      52826.03
             West       25287.85
Electronics  Central    59147.64
             East       52942.75
             North      29475.07
             South      51978.11
             West       29644.05
Furniture    Central    58207.98
             East       54920.66
             North      22494.31
             South      27932.30
             West       62857.40
Groceries    Central    33713.50
             East       44459.46
             North      55725.63
             South      27150.77
             West       32893.48
Toys         Central    41061.01
             East       67253.20
             North      50381.16
             South      53031.00
             West       52246.46
Name: Sales, dtype: float64

In [30]:
grouped_agg = df.groupby('Region')['Sales'].agg(['mean', 'sum', 'count'])
print("\nGrouped Aggregation:\n", grouped_agg)

Grouped Aggregation:
                 mean        sum  count
Region
Central  2515.497080  284251.17    113
East     2626.245470  307270.72    117
North    2426.059537  262014.43    108
South    2747.815895  261042.51     95
West     2684.928602  249698.36     93

In [31]:
df1 = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6]
})
df2 = pd.DataFrame({
    'A': [7, 8, 9],
    'B': [10, 11, 12]
})
merged_df = pd.concat([df1, df2])
merged_df

   A   B
0  1   4
1  2   5
2  3   6
0  7  10
1  8  11
2  9  12

In [33]:
pd.merge(df1, df2, on='A', how='outer')

   A  B_x   B_y
0  1  4.0   NaN
1  2  5.0   NaN
2  3  6.0   NaN
3  7  NaN  10.0
4  8  NaN  11.0
5  9  NaN  12.0

In [35]:
pd.merge(df1, df2, on='A', how='left')

   A  B_x  B_y
0  1    4  NaN
1  2    5  NaN
2  3    6  NaN